viv/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         200;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1.0;

//maxAlphaCo      0.5;

maxDeltaT       0.1;

functions
{
	
    forces
    {
        type            forces;//forces;
        libs            ("libforces.so");
        patches         ("cylinder");
        
        U	"U";
		p	"p";
		
		//// Density
		rho rhoInf;
		rhoInf 1.;
        log             on;
        writeControl    timeStep;
        writeInterval   2;
        CofR            (0 0 1.0);
    }
    
	/*vorticity
	{
    type vorticity;
    functionObjectLibs ("libfieldFunctionObjects.so");
    enabled true;
    log	true;
    writeControl timeStep;//outputTime;   
	}
	
	Q
	{
    type Q;
    functionObjectLibs ("libfieldFunctionObjects.so");
    enabled true;
    log	true;
    writeControl timeStep;//outputTime;   
	}*/
	
	
    
};
//#include "wallShear"

// ************************************************************************* //
