viv/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1; //faceLimited 
}

divSchemes
{
    default none;
    //div(rhoPhi,U)  Gauss linearUpwind grad(U);
    //div(phi,U)      Gauss upwind;//Gauss linearUpwind grad(U);
    //div(phi,alpha)  Gauss vanLeer;
    //div(phirb,alpha) Gauss upwind;
    //div((nuEff*dev(T(grad(U))))) Gauss linear;
    //div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(phi,U)        bounded Gauss linearUpwindV grad(U);
    div(phi,k)        bounded Gauss upwind;
    div(phi,epsilon)  bounded Gauss upwind;
    div(phi,omega)  bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    //default         Gauss linear corrected;
    default         Gauss linear limited corrected 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
	method		meshWave;
}

// ************************************************************************* //
